flow-over-heated-plate/fluid-openfoam-basicReactingMultiphaseCloud/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}

chemistryType
{
    solver            noChemistrySolver;
}

chemistry       off;

