flow-over-heated-plate/fluid-openfoam-basicReactingMultiphaseCloud/constant/foam.inp
elements
(
);

species
(
    H2O
);

reactions
{}
