flow-over-heated-plate/fluid-openfoam-basicReactingMultiphaseCloud/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
